Repository: NethermindEth/StarknetByExample
Catalog: po/*.po
Languages: es

source: You can use the `#[generate_trait]` attribute to implicitly generate the trait for a specific implementation block. This attribute automatically generates a trait with the same functions as the ones in the implemented block, replacing the `self` parameter with a generic `TContractState` parameter. However, you will need to annotate the block with the `#[abi(per_item)]` attribute, and each function with the appropriate attribute depending on whether it's an external function, a constructor or a l1 handler.
es: Puedes utilizar el atributo `#[generate_trait]` para generar implícitamente el trait para un bloque de implementación específico. Este atributo genera automáticamente un trait con las mismas funciones que las del bloque implementado, sustituyendo el parámetro `self` por un parámetro genérico `TContractState`. Sin embargo, tendrás que anotar el bloque con el atributo `#[abi(per_item)]`, y cada función con el atributo apropiado dependiendo de si es una función externa, un constructor o un manejador l1.

source: In summary, there's two ways to handle interfaces:
es: En resumen, hay dos formas de manejar las interfaces:

source: - Explicitly, by defining a trait annoted with `#[starknet::interface]` - Implicitly, by using `#[generate_trait]` combined with the #[abi(per_item)]` attributes, and annotating each function inside the implementation block with the appropriate attribute.
es: - Explícitamente, definiendo un trait anotado con `#[starknet::interface]` - Implícitamente, usando `#[generate_trait]` combinado con los atributos #[abi(per_item)]` y anotando cada función dentro del bloque de implementación con el atributo apropiado.

source: ## Explicit interface
es: ## Interfaz explícita

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/explicit.cairo).
es: Juega con este contrato en[Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/explicit.cairo).

source: ## Implicit interface
es: ## Interfaz implícita

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/implicit.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/implicit.cairo).

source: > Note: You can import an implicitly generated contract interface with `use contract::{GeneratedContractInterface}`. However, the `Dispatcher` will not be generated automatically.
es: > Nota: Puede importar una interfaz de contrato generada implícitamente con `use contract::{GeneratedContractInterface}`. Sin embargo, el `Dispatcher` no se generará automáticamente.

source: ## Internal functions
es: ## Funciones internas

source: You can also use `#[generate_trait]` for your internal functions. Since this trait is generated in the context of the contract, you can define pure functions as well (functions without the `self` parameter).
es: También puedes usar `#[generate_trait]` para tus funciones internas. Dado que este trait se genera en el contexto del contrato, también puedes definir funciones puras (funciones sin el parámetro `self`).

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/implicit_internal.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/interfaces_traits/src/implicit_internal.cairo).

source: # Calling other contracts
es: ## Llamar a otros contratos

source: There are two different ways to call other contracts in Cairo.
es: Hay dos formas diferentes de llamar a otros contratos en Cairo.

source: The easiest way to call other contracts is by using the dispatcher of the contract you want to call. You can read more about Dispatchers in the [Cairo Book](https://book.cairo-lang.org/ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.html#contract-dispatcher)
es: La forma más sencilla de llamar a otros contratos es utilizar el dispatcher del contrato al que desea llamar. Puede leer más sobre los dispatcher en el [Libro de El Cairo](https://book.cairo-lang.org/ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.html#contract-dispatcher)

source: The other way is to use the `starknet::call_contract_syscall` syscall yourself. However, this method is not recommended.
es: La otra forma es utilizar la llamada al sistema `starknet::call_contract_syscall`. Sin embargo, este método no es recomendable.

source: In order to call other contracts using dispatchers, you will need to define the called contract's interface as a trait annotated with the `#[starknet::interface]` attribute, and then import the `IContractDispatcher` and `IContractDispatcherTrait` items in your contract.
es: Para llamar a otros contratos utilizando dispatchers, tendrás que definir la interfaz del contrato llamado como un trait anotado con el atributo `#[starknet::interface]`, y luego importar los elementos `IContractDispatcher` e `IContractDispatcherTrait` en tu contrato.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x015c3Bb6D0DE26b64FEAF9A8f4655CfADb5c128bF4510398972704ee12775DB1) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/calling_other_contracts/src/callee.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x015c3Bb6D0DE26b64FEAF9A8f4655CfADb5c128bF4510398972704ee12775DB1) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/calling_other_contracts/src/callee.cairo).

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x05fa8aF796343d2f22c53C17149386b67B7AC4aB52D9e308Aa507C185aA44778) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/calling_other_contracts/src/caller.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x05fa8aF796343d2f22c53C17149386b67B7AC4aB52D9e308Aa507C185aA44778) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/calling_other_contracts/src/caller.cairo).

source: # Factory Pattern
es: # Patrón de la Factory

source: The factory pattern is a well known pattern in object oriented programming. It provides an abstraction on how to instantiate a class.
es: El patrón de factory es un patrón bien conocido en la programación orientada a objetos. Proporciona una abstracción sobre cómo instanciar una clase.

source: In the case of smart contracts, we can use this pattern by defining a factory contract that have the sole responsibility of creating and managing other contracts.
es: En el caso de los smart contracts, podemos utilizar este patrón definiendo un contrato de factory que tenga la responsabilidad exclusiva de crear y gestionar otros contratos.

source: ## Class hash and contract instance
es: # Class hash e instancia de contrato

source: In Starknet, there's a separation between contract's classes and instances. A contract class serves as a blueprint, defined by the underling Cairo bytecode, contract's entrypoints, ABI and Sierra program hash. The contract class is identified by a class hash. When you want to add a new class to the network, you first need to declare it.
es: En Starknet, hay una separación entre las clases de contrato y las instancias. Una clase de contrato sirve como plano, definido por el código de bytes subyacente de Cairo, los puntos de entrada del contrato, la ABI y el hash del programa Sierra. La clase del contrato es identificada por un hash de clase. Cuando se desea agregar una nueva clase a la red, primero es necesario declararla.

source: When deploying a contract, you need to specify the class hash of the contract you want to deploy. Each instance of a contract has their own storage regardless of the class hash.
es: Cuando se despliega un contrato, es necesario especificar el hash de clase del contrato que se desea desplegar. Cada instancia de un contrato tiene su propio almacenamiento independientemente del hash de clase.

source: Using the factory pattern, we can deploy multiple instances of the same contract class and handle upgrades easily.
es: Utilizando el patrón de factory, podemos desplegar múltiples instancias de la misma clase de contrato y manejar las actualizaciones fácilmente.

source: ## Minimal example
es: ## Ejemplo mínimo

source: Here's a minimal example of a factory contract that deploy the `SimpleCounter` contract:
es: He aquí un ejemplo mínimo de un contrato de factory que despliega el contrato `SimpleCounter`:

source: <!-- This is not ready for "Open in remix" because we need multiple files -->
es: <!-- Esto no está listo para "Abrir en remix" porque necesitamos varios archivos -->

source: This factory can be used to deploy multiple instances of the `SimpleCounter` contract by calling the `create_counter` and `create_counter_at` functions.
es: Esta fábrica se puede utilizar para desplegar múltiples instancias del contrato `SimpleCounter` llamando a las funciones `create_counter` y `create_counter_at`.

source: The `SimpleCounter` class hash is stored inside the factory, and can be upgraded with the `update_counter_class_hash` function which allows to reuse the same factory contract when the `SimpleCounter` contract is upgraded.
es: El hash de la clase `SimpleCounter` se almacena dentro de la fábrica, y se puede actualizar con la función `update_counter_class_hash` que permite reutilizar el mismo contrato de fábrica cuando se actualiza el contrato `SimpleCounter`.

source: This minimal example lacks several useful features such as access control, tracking of deployed contracts, events, ...
es: Este ejemplo mínimo carece de varias funciones útiles, como el control de acceso, el seguimiento de los contratos desplegados, los eventos, ...

source: <!-- TODO maybe add a more complete example at the end of this section or in the `Applications examples` chapter --> <footer id="last-change">Last change: 2023-12-21</footer>
es: <!-- TODO tal vez agregue un ejemplo más completo al final de esta sección o en el capítulo `Ejemplos de aplicaciones` --> <footer id="last-change">Último cambio: 2023-12-21</footer>

source: # Contract Testing
es: # Testing de Contrato

source: Testing plays a crucial role in software development, especially for smart contracts. In this section, we'll guide you through the basics of testing a smart contract on Starknet with `scarb`.
es: Las pruebas juegan un papel crucial en el desarrollo de software, especialmente para los smart contracts. En esta sección, te guiaremos a través de los conceptos básicos de las pruebas de un smart contracts en Starknet con `scarb`.

source: Let's start with a simple smart contract as an example:
es: Empecemos con un simple contrato inteligente como ejemplo:

source: Now, take a look at the tests for this contract:
es: Ahora, eche un vistazo a las pruebas de este contrato:

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/testing_how_to/src/lib.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/testing_how_to/src/lib.cairo).

source: To define our test, we use scarb, which allows us to create a separate module guarded with `#[cfg(test)]`. This ensures that the test module is only compiled when running tests using `scarb test`.
es: Para definir nuestro test, usamos scarb, que nos permite crear un módulo separado protegido con `#[cfg(test)]`. Esto asegura que el módulo de prueba sólo se compila cuando se ejecutan pruebas utilizando `scarb test`.

source: Each test is defined as a function with the `#[test]` attribute. You can also check if a test panics using the `#[should_panic]` attribute.
es: Cada prueba se define como una función con el atributo `#[test]`. También puede comprobar si una prueba entra en pánico utilizando el atributo `#[should_panic]`.

source: As we are in the context of a smart contract, it's essential to set up the gas limit. You do this by using the `#[available_gas(X)]` attribute to specify the gas limit for a test. This is also a great way to ensure that your contract's features stay under a certain gas limit!
es: Como estamos en el contexto de un smart contract, es esencial establecer el límite de gas. Esto se hace utilizando el atributo `#[available_gas(X)]` para especificar el límite de gas para una prueba. ¡Esta es también una gran manera de asegurar que las funciones de tu contrato se mantienen por debajo de un cierto límite de gas!

source: > Note: The term "gas" here refers to Sierra gas, not L1 gas
es: >Nota: El término "gas" se refiere aquí al gas Sierra, no al gas L1

source: Now, let's move on to the testing process:
es: Pasemos ahora al proceso de prueba:

source: - Use the `deploy` function logic to declare and deploy your contract. - Use `assert` to verify that the contract behaves as expected in the given context.
es: - Utilice la lógica de la función `deploy` para declarar e implementar su contrato. - Utilice `assert` para verificar que el contrato se comporta como se espera en el contexto dado.

source: To make testing more convenient, the `testing` module of the corelib provides some helpful functions:
es: Para que las pruebas resulten más cómodas, el módulo `testing` de corelib proporciona algunas funciones útiles:

source: You may also need the `info` module from the corelib, which allows you to access information about the current execution context (see [syscalls](../basics/syscalls.md)):
es: Es posible que también necesite el módulo `info` de corelib, que le permite acceder a información sobre el contexto de ejecución actual (consulte [syscalls](../basics/syscalls.md)):

source: You can found the full list of functions in the [Starknet Corelib repo](https://github.com/starkware-libs/cairo/tree/main/corelib/src/starknet). You can also find a detailled explaination of testing in cairo in the [Cairo book - Chapter 9](https://book.cairo-lang.org/ch09-01-how-to-write-tests.html).
es: Puede encontrar la lista completa de funciones en el [repositorio de Starknet Corelib](https://github.com/starkware-libs/cairo/tree/main/corelib/src/starknet). También puede encontrar una explicación detallada de las pruebas en Cairo en el [Libro de Cairo - Capítulo 9](https://book.cairo-lang.org/ch09-01-how-to-write-tests.html).

source: <!-- TODO update this when Starknet Foundry is more mature. -->
es: <!-- TODO actualice esto cuando Starknet Foundry esté más maduro. -->

source: Starknet Foundry is a powerful toolkit for developing smart contracts on Starknet. It offers support for testing Starknet smart contracts on top of `scarb` with the `Forge` tool.
es: Starknet Foundry es un potente conjunto de herramientas para el desarrollo de contratos inteligentes en Starknet. Ofrece soporte para probar contratos inteligentes Starknet sobre `scarb` con la herramienta `Forge`.

source: Testing with `snforge` is similar to the process we just described but simplified. Moreover, additional features are on the way, including cheatcodes or parallel tests execution. We highly recommend exploring Starknet Foundry and incorporating it into your projects.
es: Probar con `snforge` es similar al proceso que acabamos de describir, pero simplificado. Además, hay características adicionales en camino, incluyendo cheatcodes o ejecución de pruebas en paralelo. Recomendamos encarecidamente explorar Starknet Foundry e incorporarlo a tus proyectos.

source: For more detailed information about testing contracts with Starknet Foundry, check out the [Starknet Foundry Book - Testing Contracts](https://foundry-rs.github.io/starknet-foundry/testing/contracts.html).
es: Si desea información más detallada sobre los contratos de pruebas con Starknet Foundry, consulte el [Starknet Foundry Book - Testing Contracts](https://foundry-rs.github.io/starknet-foundry/testing/contracts.html).

source: # Cairo Cheatsheet
es: # Hoja de ruta de Cairo

source: This chapter aims to provide a quick reference for the most common Cairo constructs.
es: Este capítulo pretende ofrecer una referencia rápida para las construcciones más comunes de Cairo.

source: <footer id="last-change">Last change: 2023-10-31</footer>
es: <footer id="last-change">Último cambio: 2023-10-31</footer>

source: Felt252 is a fundamental data type in Cairo from which all other data types are derived. Felt252 can also be used to store short-string representations with a maximum length of 31 characters.
es: Felt252 es un tipo de datos fundamental en Cairo del que se derivan todos los demás tipos de datos. Felt252 también se puede utilizar para almacenar representaciones de cadenas cortas con una longitud máxima de 31 caracteres.

source: For example:
es: Por ejemplo:

source: The ```LegacyMap``` type can be used to represent a collection of key-value.
es: El tipo ```LegacyMap``` se puede utilizar para representar una colección de key-value.

source: Arrays are collections of elements of the same type. The possible operations on arrays are defined with the `array::ArrayTrait` of the corelib:
es: Los arrays son colecciones de elementos del mismo tipo. Las posibles operaciones sobre arrays se definen con el `array::ArrayTrait` de corelib:

source: A loop specifies a block of code that will run repetitively until a halting condition is encountered. For example:
es: Un bucle especifica un bloque de código que se ejecutará repetitivamente hasta que se encuentre una condición de detención. Por ejemplo:

source: The `match` expression in Cairo allows us to control the flow of our code by comparing a `felt252` data type or an enum against various patterns and then running specific code based on the pattern that matches. For example:
es: La expresión `match` en Cairo nos permite controlar el flujo de nuestro código comparando un tipo de datos sentido o una enumeración con varios patrones y luego ejecutando código específico basado en el patrón que coincide. Por ejemplo:

source: Tuples is a data type to group a fixed number of items of potentially different types into a single compound structure. Unlike arrays, tuples have a set length and can contain elements of varying types. Once a tuple is created, its size cannot change. For example:
es: Las Tuplas es un tipo de datos para agrupar un número fijo de elementos de tipos potencialmente diferentes en una única estructura compuesta. A diferencia de las arrays, las tuplas tienen una longitud determinada y pueden contener elementos de distintos tipos. Una vez creada una tupla, su tamaño no puede cambiar. Por ejemplo:

source: A struct is a data type similar to tuple. Like tuples they can be used to hold data of different types. For example:
es: Una estructura es un tipo de datos similar a una tupla. Al igual que las tuplas, se pueden utilizar para contener datos de diferentes tipos.Por ejemplo:

source: # Type casting
es: # Conversión de Tipos

source: Cairo supports the conversion from one scalar types to another by using the into and try_into methods. `traits::Into` is used for conversion from a smaller data type to a larger data type, while `traits::TryInto` is used when converting from a larger to a smaller type that might not fit. For example:
es: Cairo admite la conversión de un tipo escalar a otro mediante el uso de los métodos into y try_into. `traits::Into` se usa para la conversión de un tipo de datos más pequeño a un tipo de datos más grande, mientras que `traits::TryInto` se usa para convertir de un tipo más grande a uno más pequeño que podría no encajar. Por ejemplo:

source: # Components How-To
es: # Cómo hacer Componentes

source: Components are like modular addons that can be snapped into contracts to add reusable logic, storage, and events. They are used to separate the core logic from common functionalities, simplifying the contract's code and making it easier to read and maintain. It also reduces the risk of bugs and vulnerabilities by using well-tested components.
es: Los componentes son como complementos modulares que se pueden integrar en contratos para agregar lógica, almacenamiento y eventos reutilizables. Se utilizan para separar la lógica central de las funcionalidades comunes, simplificando el código del contrato y haciéndolo más fácil de leer y mantener. También reduce el riesgo de errores y vulnerabilidades mediante el uso de componentes bien probados.

source: Key characteristics:
es: Caracteristicas claves:

source: - Modularity: Easily pluggable into multiple contracts. - Reusable Logic: Encapsulates specific functionalities. - Not Standalone: Cannot be declared or deployed independently.
es: - Modularidad: Fácilmente conectable a múltiples contratos. - Lógica Reutilizable: Encapsula funcionalidades específicas. - No autónomo: no se puede declarar ni implementar de forma independiente.

source: ## How to create a component
es: ## Cómo crear un componente

source: The following example shows a simple `Switchable` component that can be used to add a switch that can be either on or off. It contains a storage variable `switchable_value`, a function `switch` and an event `Switch`.
es: El siguiente ejemplo muestra un componente `Switchable` simple que se puede usar para agregar un interruptor que puede estar encendido o apagado. Contiene una variable de almacenamiento `switchable_value`, una función `switch` y un evento `Switch`.

source: > It is a good practice to prefix the component storage variables with the component name to [avoid collisions](./collisions.md).
es: > Es una buena práctica anteponer las variables de almacenamiento del componente con el nombre del componente para [evitar colisiones] (./collisions.md).

source: A component in itself is really similar to a contract, it *can* also have:
es: Un componente en sí mismo es muy similar a un contrato, *puede* también tener:

source: - An interface defining entrypoints (`ISwitchableComponent<TContractState>`) - A Storage struct - Events - Internal functions
es: - Una interfaz que define puntos de entrada (`ISwitchableComponent<TContractState>`) - Una estructura de Storage - Eventos - Funciones internas

source: It don't have a constructor, but you can create a `_init` internal function and call it from the contract's constructor. In the previous example, the `_off` function is used this way.
es: No tiene constructor, pero puedes crear una función interna `_init` y llamarla desde el constructor del contrato. En el ejemplo anterior, la función `_off` se usa de esta manera.
