Repository: NethermindEth/StarknetByExample
Catalog: po/*.po
Languages: es

source: Introduction
es: Introducción

source: Getting Started
es: Primeros Pasos

source: Basics of a Starknet contract
es: Conceptos Básicos de un Contrato de Starknet

source: Storage
es: Almacenamiento

source: Visibility and Mutability
es: Visibilidad y Mutabilidad

source: Counter Example
es: Ejemplo de Counter

source: Mappings
es: Mapas

source: Errors
es: Errores

source: Events
es: Eventos

source: Syscalls
es: Llamadas al Sistema

source: Storing Custom Types
es: Almacenamiento de Tipos Personalizados

source: Custom types in entrypoints
es: Tipos personalizados en entrypoints

source: Documentation
es: Documentación

source: Deploy and interact with contracts
es: Desplegar contratos e interactuar con ellos

source: Contract interfaces and Traits generation
es: Interfaces de Contratos y generación de Traits

source: Calling other contracts
es: Llamar a otros contratos

source: Factory pattern
es: Patrón de la Factory

source: Testing contracts
es: Contratos de Testing

source: Cairo cheatsheet
es: Hoja de ruta de Cairo

source: Type casting
es: Conversión de Tipos

source: Components
es: Componentes

source: Components How-To
es: Cómo hacer Componentes

source: Components Dependencies
es: Componentes Dependencias

source: Storage Collisions
es: Colisiones de Almacenamiento

source: Applications
es: Aplicaciones

source: Upgradeable Contract
es: Contratos Actualizables

source: ERC20 Token
es: Token ERC20

source: Constant Product AMM
es: AMM de Producto Constante

source: Advanced concepts
es: Conceptos Avanzados

source: Writing to any storage slot
es: Escribir en cualquier ranura de almacenamiento

source: Storing Arrays
es: Almacenamiento de Arrays

source: Struct as mapping key
es: Estructura como mapping key

source: Hash Solidity Compatible
es: Hash compatible con Solidity

source: Optimisations
es: Optimizaciones

source: Storage Optimisations
es: Optimizaciones de Almacenamiento

source: List
es: Lista

source: Starknet By Example is a collection of examples of how to use the Cairo programming language to create smart contracts on Starknet.
es: Starknet By Example es una colección de ejemplos de cómo utilizar el lenguaje de programación de Cairo para crear smart contracts en Starknet.

source: Starknet is a permissionless Validity-Rollup that supports general computation. It is currently used as an Ethereum layer-2. Starknet use the STARK cryptographic proof system to ensure high safety and scalability.
es: Starknet es un Validity-Rollup sin permiso que admite el cálculo general. Actualmente se utiliza como capa 2 de Ethereum. Starknet utiliza el sistema de prueba criptográfica STARK para garantizar una alta seguridad y escalabilidad.

source: Starknet smart contracts are written in the Cairo language. Cairo is a Turing-complete programming language designed to write provable programs, abstracting the zk-STARK proof system away from the programmer.
es: Los smart contracts de Starknet están escritos en el idioma de Cairo. Cairo es un lenguaje de programación completo de Turing diseñado para escribir programas demostrables, abstrayendo el sistema de prueba zk-STARK del programador.

source: The current version of this book use:
es: La versión actual de este libro usa:

source: > ⚠️ The examples have not been audited and are not intended for production use. > The authors are not responsible for any damages caused by the use of the code provided in this book.
es: > ⚠️ Los ejemplos no han sido auditados y no están pensados para su uso en producción. > Los autores no se hacen responsables de los daños causados por el uso del código proporcionado en este libro.

source: ## For whom is this for?
es: ## ¿Para quién es esto?

source: Starknet By Example is for anyone who wants to quickly learn how to write smart contracts on Starknet using Cairo with some technical background in programming and blockchain.
es: Starknet By Example es para cualquiera que quiera aprender rápidamente cómo escribir contratos inteligentes en Starknet usando Cairo con cierta experiencia técnica en programación y blockchain.

source: The first chapters will give you a basic understanding of the Cairo programming language and how to write, deploy and use smart contracts on Starknet. The later chapters will cover more advanced topics and show you how to write more complex smart contracts.
es: Los primeros capítulos le brindarán una comprensión básica del lenguaje de programación Cairo y cómo escribir, implementar y utilizar contratos inteligentes en Starknet. Los capítulos posteriores cubrirán temas más avanzados y le mostrarán cómo escribir contratos inteligentes más complejos.

source: ## Further reading
es: ## Otras lecturas

source: If you want to learn more about the Cairo programming language, you can read the [Cairo Book](https://book.cairo-lang.org). If you want to learn more about Starknet, you can read the [Starknet documentation](https://docs.starknet.io/) and the [Starknet Book](https://book.starknet.io).
es: Si desea obtener más información sobre el lenguaje de programación de Cairo, puede leer el [Cairo Book](https://book.cairo-lang.org). Si desea obtener más información sobre Starknet, puede leer la [Documentación de Starknet](https://docs.starknet.io/) y el [Starknet Book](https://book.starknet.io).

source: For more resources, check [Awesome Starknet](https://github.com/keep-starknet-strange/awesome-starknet).
es: Para obtener más recursos, consulte [Awesome Starknet](https://github.com/keep-starknet-strange/awesome-starknet).

source: <footer id="last-change">Last change: 2023-12-07</footer>
es: <footer id="last-change">Último cambio: 2023-12-07</footer>

source: # Basics of Smart Contracts in Cairo
es: # Conceptos básicos de los Smart Contracts en Cairo

source: The following chapters will introduce you to Starknet smart contracts and how to write them in Cairo.
es: Los siguientes capítulos le presentarán los smart contracts de Starknet y cómo escribirlos en Cairo.

source: <footer id="last-change">Last change: 2023-10-12</footer>
es: <footer id="last-change">Último cambio: 2023-10-12</footer>

source: # Storage
es: # Almacenamiento

source: Here's the most minimal contract you can write in Cairo:
es: Este es el contrato mínimo que puedes redactar en Cairo:

source: Storage is a struct annoted with `#[storage]`. Every contract must have one and only one storage. It's a key-value store, where each key will be mapped to a storage address of the contract's storage space.
es: El almacenamiento es una estructura (struct) anotada con `#[storage]`. Cada contrato debe tener un único almacenamiento. Es un almacén key-value, donde cada key se asignará a una dirección de almacenamiento del espacio de almacenamiento del contrato.

source: You can define [storage variables](./variables.md#storage-variables) in your contract, and then use them to store and retrieve data.
es: Puede definir [variables de storage](./variables.md#storage-variables) en su contrato y luego usarlas para almacenar y recuperar datos.

source: > Actually these two contracts have the same underlying Sierra program. > From the compiler's perspective, the storage variables don't exist until they are used.
es: > En realidad estos dos contratos tienen el mismo programa Sierra subyacente. > Desde la perspectiva del compilador, las variables de almacenamiento no existen hasta que se utilizan.

source: You can also read about [storing custom types](./storing-custom-types.md)
es: También puede leer sobre [almacenamiento de tipos personalizados](./storing-custom-types.md)

source: Constructors are a special type of function that runs only once when deploying a contract, and can be used to initialize the state of the contract. Your contract must not have more than one constructor, and that constructor function must be annotated with the `#[constructor]` attribute. Also, a good practice consists in naming that function `constructor`.
es: Los constructores son un tipo especial de función que se ejecuta solo una vez al implementar un contrato y se pueden usar para inicializar el estado del contrato. Su contrato no debe tener más de un constructor, y esa función constructora debe estar anotada con el atributo `#[constructor]`. Además, una buena práctica consiste en denominar a esa función `constructor`.

source: Here's a simple example that demonstrates how to initialize the state of a contract on deployment by defining logic inside a constructor.
es: A continuación se muestra un ejemplo sencillo que demuestra cómo inicializar el estado de un contrato durante la implementación definiendo la lógica dentro de un constructor.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x017fd6558e67451dA583d123D77F4e2651E91502D08F8F8432355293b11e1f8F) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/constructor/src/constructor.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x017fd6558e67451dA583d123D77F4e2651E91502D08F8F8432355293b11e1f8F) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/constructor/src/constructor.cairo).

source: There are 3 types of variables in Cairo contracts:
es: Hay 3 tipos de variables en los contratos de Cairo:

source: - Local - declared inside a function - not stored on the blockchain - Storage - declared in the [Storage](./storage.md) of a contract - can be accessed from one execution to another - Global - provides information about the blockchain - accessed anywhere, even within library functions
es: - Local - Declarado dentro de una función - No almacenado en blockchain - Almacenamiento - Declarado en el [Almacenamiento](./storage.md) de un contrato - Se puede acceder de una ejecución a otra - Global - Proporciona información sobre la blockchain - Se accede desde cualquier lugar, incluso dentro de las funciones de la biblioteca

source: ## Local Variables
es: ## Variables Locales

source: Local variables are used and accessed within the scope of a specific function or block of code. They are temporary and exist only for the duration of that particular function or block execution.
es: Las variables locales se utilizan y se accede a ellas dentro del alcance de una función o bloque de código específico. Son temporales y existen solo mientras dure esa función en particular o la ejecución del bloque.

source: Local variables are stored in memory and are not stored on the blockchain. This means they cannot be accessed from one execution to another. Local variables are useful for storing temporary data that is relevant only within a specific context. They also make the code more readable by giving names to intermediate values.
es: Las variables locales se almacenan en la memoria y no en la cadena de bloques. Esto significa que no se puede acceder a ellos de una ejecución a otra. Las variables locales son útiles para almacenar datos temporales que son relevantes sólo dentro de un contexto específico. También hacen que el código sea más legible al dar nombres a los valores intermedios.

source: Here's a simple example of a contract with only local variables:
es: Aquí hay un ejemplo simple de un contrato con solo variables locales:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x015B3a10F9689BeD741Ca3C210017BC097122CeF76f3cAA191A20ff8b9b56b96) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/variables/src/local_variables.cairo).
es: Visite el contrato en [Voyager](https://goerli.voyager.online/contract/0x015B3a10F9689BeD741Ca3C210017BC097122CeF76f3cAA191A20ff8b9b56b96) o juegue con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/variables/src/local_variables.cairo).

source: ## Storage Variables
es: ## Variables de Storage

source: Storage variables are persistent data stored on the blockchain. They can be accessed from one execution to another, allowing the contract to remember and update information over time.
es: Las variables de almacenamiento (storage) son datos persistentes almacenados en la blockchain. Se puede acceder a ellos de una ejecución a otra, lo que permite que el contrato recuerde y actualice la información a lo largo del tiempo.

source: To write or update a storage variable, you need to interact with the contract through an external entrypoint by sending a transaction.
es: Para escribir o actualizar una variable de storage, debe interactuar con el contrato a través de un punto de entrada externo mediante el envío de una transacción.

source: On the other hand, you can read state variables, for free, without any transaction, simply by interacting with a node.
es: Por otro lado, puedes leer variables de estado, de forma gratuita, sin ninguna transacción, simplemente interactuando con un nodo.

source: Here's a simple example of a contract with one storage variable:
es: A continuación se muestra un ejemplo sencillo de un contrato con una variable de almacenamiento:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x06eA827B32875483709b785A7F9e846a52776Cd8D42C3fE696218c2624b0DCCa) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/variables/src/storage_variables.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x06eA827B32875483709b785A7F9e846a52776Cd8D42C3fE696218c2624b0DCCa) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/variables/src/storage_variables.cairo).

source: ## Global Variables
es: ## Variables Globales

source: Global variables are predefined variables that provide information about the blockchain and the current execution environment. They can be accessed at any time and from anywhere!
es: Las variables globales son variables predefinidas que proporcionan información sobre la blockchain y el entorno de ejecución actual. ¡Se puede acceder a ellos en cualquier momento y desde cualquier lugar!

source: In Starknet, you can access global variables by using specific functions contained in the starknet core libraries.
es: En Starknet, puede acceder a variables globales utilizando funciones específicas contenidas en las bibliotecas principales de Starknet.

source: For example, the `get_caller_address` function returns the address of the caller of the current transaction, and the `get_contract_address` function returns the address of the current contract.
es: Por ejemplo, la función `get_caller_address` devuelve la dirección de la persona que llama de la transacción actual, y la función `get_contract_address` devuelve la dirección del contrato actual.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x05bD2F3943bd4e030f85678b55b2EC2C1be939e32388530FB20ED967B3Be433F) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/variables/src/global_variables.cairo).
es: Visite el contrato en [Voyager](https://goerli.voyager.online/contract/0x05bD2F3943bd4e030f85678b55b2EC2C1be939e32388530FB20ED967B3Be433F) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/variables/src/global_variables.cairo).

source: # Visibility and Mutability
es: # Visibilidad y Mutabilidad

source: ## Visibility
es: ## Visibilidad

source: There are two types of functions in Starknet contracts:
es: Hay dos tipos de funciones en los contratos Starknet:

source: - Functions that are accessible externally and can be called by anyone. - Functions that are only accessible internally and can only be called by other functions in the contract.
es: - Funciones a las que se puede acceder externamente y que cualquiera puede llamar. - Funciones a las que solo se puede acceder internamente y que solo pueden ser invocadas por otras funciones del contrato.

source: These functions are also typically divided into two different implementations blocks. The first `impl` block for externally accessible functions is explicitly annotated with an `#[abi(embed_v0)]` attribute. This indicates that all the functions inside this block can be called either as a transaction or as a view function. The second `impl` block for internally accessible functions is not annotated with any attribute, which means that all the functions inside this block are private by default.
es: Estas funciones también suelen dividirse en dos bloques de implementación diferentes. El primer bloque `impl` para funciones accesibles externamente está anotado explícitamente con un atributo `#[abi(embed_v0)]`. Esto indica que todas las funciones dentro de este bloque se pueden llamar como una transacción o como una función de view. El segundo bloque `impl` para funciones accesibles internamente no está anotado con ningún atributo, lo que significa que todas las funciones dentro de este bloque son privadas de forma predeterminada.

source: ## State Mutability
es: ## Mutabilidad del Estado

source: Regardless of whether a function is internal or external, it can either modify the contract's state or not. When we declare functions that interact with storage variables inside a smart contract, we need to explicitly state that we are accessing the `ContractState` by adding it as the first parameter of the function. This can be done in two different ways:
es: Independientemente de si una función es interna o externa, puede modificar el estado del contrato o no. Cuando declaramos funciones que interactúan con variables de almacenamiento dentro de un smart contract, debemos indicar explícitamente que estamos accediendo al `ContractState` agregándolo como el primer parámetro de la función. Esto se puede hacer de dos maneras diferentes:

source: - If we want our function to be able to mutate the state of the contract, we pass it by reference like this: `ref self: ContractState`. - If we want our function to be read-only and not mutate the state of the contract, we pass it by snapshot like this: `self: @ContractState`.
es: - Si queremos que nuestra función pueda mutar el estado del contrato, lo pasamos por referencia así: `ref self: ContractState`. - Si queremos que nuestra función sea de solo lectura y no mute el estado del contrato, la pasamos por instantánea como esta: `self: @ContractState`.

source: Read-only functions, also called view functions, can be directly called without making a transaction. You can interact with them directly through a RPC node to read the contract's state, and they're free to call! External functions, that modify the contract's state, on the other side can only be called by making a transaction.
es: Las funciones de solo lectura, también llamadas funciones de visualización, se pueden llamar directamente sin realizar una transacción. Puede interactuar con ellos directamente a través de un nodo RPC para leer el estado del contrato, ¡y pueden llamar libremente! Las funciones externas, que modifican el estado del contrato, por otro lado, solo se pueden llamar realizando una transacción.

source: Internal functions can't be called externally, but the same principle applies regarding state mutability.
es: Las funciones internas no se pueden llamar externamente, pero se aplica el mismo principio con respecto a la mutabilidad de estado.

source: Let's take a look at a simple example contract to see these in action:
es: Echemos un vistazo a un contrato de ejemplo simple para verlos en acción:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x0071dE3093AB58053b0292C225aa0eED40293e7694A0042685FF6D813d39889F) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/visibility/src/visibility.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x0071dE3093AB58053b0292C225aa0eED40293e7694A0042685FF6D813d39889F) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/visibility/src/visibility.cairo).

source: # Simple Counter
es: # Counter Sencillo

source: This is a simple counter contract.
es: Este es un contrato de un simple counter.

source: Here's how it works:
es: Así es como trabaja:

source: - The contract has a state variable called 'counter' that is initialized to 0. - When a user calls 'increment', the contract increments the counter by 1. - When a user calls 'decrement', the contract decrements the counter by 1.
es: - El contrato tiene una variable de estado llamada 'counter' que se inicializa a 0. - Cuando un usuario llama 'increment', el contrato incrementa el contador en 1. - Cuando un usuario llama 'decrement', el contrato disminuye el contador en 1.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x01664a69Fe701a1df7Bb0ae4A353792d0cf4E27146ee860075cbf6108b1D5718) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/counter/src/contracts.cairo).
es: Visite el contrato en [Voyager](https://goerli.voyager.online/contract/0x01664a69Fe701a1df7Bb0ae4A353792d0cf4E27146ee860075cbf6108b1D5718) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/counter/src/contracts.cairo).

source: # Mappings
es: # Mapas

source: Maps are a key-value data structure used to store data within a smart contract. In Cairo they are implemented using the `LegacyMap` type. It's important to note that the `LegacyMap` type can only be used inside the `Storage` struct of a contract and that it can't be used elsewhere.
es: Los mapas son una estructura de datos de key-value que se utiliza para almacenar datos dentro de un contrato inteligente. En Cairo se implementan utilizando el tipo `LegacyMap`. Es importante tener en cuenta que el tipo `LegacyMap` solo se puede usar dentro de la estructura `Storage` de un contrato y no se puede usar en ningún otro lugar.

source: Here we demonstrate how to use the `LegacyMap` type within a Cairo contract, to map between a key of type `ContractAddress` and value of type `felt252`. The key-value types are specified within angular brackets <>. We write to the map by calling the `write()` method, passing in both the key and value. Similarly, we can read the value associated with a given key by calling the `read()` method and passing in the relevant key.
es: Aquí demostramos cómo usar el tipo `LegacyMap` dentro de un contrato de Cairo, para mapear entre una clave de tipo `ContractAddress` y un valor de tipo `felt252`. Los tipos key-value se especifican entre corchetes angulares <>. Escribimos en el mapa llamando al método `write()`, pasando tanto la clave como el valor. De manera similar, podemos leer el valor asociado con una clave determinada llamando al método `read()` y pasando la clave relevante.

source: Some additional notes:
es: Algunas notas adicionales:
