Repository: NethermindEth/StarknetByExample
Catalog: po/*.po
Languages: es

source: - More complex key-value mappings are possible, for example we could use `LegacyMap::<(ContractAddress, ContractAddress), felt252>` to create an allowance on an ERC20 token contract. - In mappings, the address of the value at key `k_1,...,k_n` is `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)` where `ℎ` is the Pedersen hash and the final value is taken `mod2251−256`. You can learn more about the contract storage layout in the [Starknet Documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables).
es: - Son posibles asignaciones key-value más complejas; por ejemplo, podríamos usar `LegacyMap::<(ContractAddress, ContractAddress), Felt252>` para crear una asignación en un contrato de token ERC20. - En las asignaciones, la dirección del valor en la clave `k_1,...,k_n` es `h(...h(h(sn_keccak(nombre_variable),k_1),k_2),...,k_n)` donde `ℎ` es el hash de Pedersen y el valor final se toma `mod2251−256`. Puede obtener más información sobre el diseño de almacenamiento por contrato en la [Documentación de Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables).

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x06214AB4c23Cc545bf2221D465eB83aFb7412779AD498BD48a724B3F645E3505) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/mappings/src/mappings.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x06214AB4c23Cc545bf2221D465eB83aFb7412779AD498BD48a724B3F645E3505) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/mappings/src/mappings.cairo).

source: <footer id="last-change">Last change: 2023-12-17</footer>
es: <footer id="last-change">Último cambio: 2023-12-17</footer>

source: # Errors
es: # Errores

source: Errors can be used to handle validation and other conditions that may occur during the execution of a smart contract. If an error is thrown during the execution of a smart contract call, the execution is stopped and any changes made during the transaction are reverted.
es: Los errores se pueden utilizar para manejar la validación y otras condiciones que pueden ocurrir durante la ejecución de un smart contract. Si se produce un error durante la ejecución de una llamada de smart contract, la ejecución se detiene y se revierte cualquier cambio realizado durante la transacción.

source: To throw an error, use the `assert` or `panic` functions:
es: Para generar un error, use las funciones `assert` o `panic`:

source: - `assert` is used to validate conditions. If the check fails, an error is thrown along with a specified value, often a message. It's similar to the `require` statement in Solidity. - `panic` immediately halt the execution with the given error value. It should be used when the condition to check is complex and for internal errors. It's similar to the `revert` statement in Solidity. (Use `panic_with_felt252` to be able to directly pass a felt252 as the error value)
es: - `assert` se utiliza para validar condiciones. Si la verificación falla, se genera un error junto con un valor específico, a menudo un mensaje. Es similar a la declaración `require` en Solidity. - `panic` detiene inmediatamente la ejecución con el valor de error dado. Debe utilizarse cuando la condición a comprobar es compleja y para errores internos. Es similar a la declaración `revert` en Solidity. (Utilice `panic_with_felt252` para poder pasar directamente un fieltro252 como valor de error)

source: Here's a simple example that demonstrates the use of these functions:
es: Aquí hay un ejemplo simple que demuestra el uso de estas funciones:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x0022664463FF0b711CC9B549a9E87d65A0882bB1D29338C4108696B8F2216a40) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/errors/src/simple_errors.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x0022664463FF0b711CC9B549a9E87d65A0882bB1D29338C4108696B8F2216a40) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/errors/src/simple_errors.cairo).

source: ## Custom errors
es: ## Errores personalizados

source: You can make error handling easier by defining your error codes in a specific module.
es: Puede facilitar el manejo de errores definiendo sus códigos de error en un módulo específico.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x0501CD5da5B453a18515B5A20b8029bd7583DFE7a399ad9f79c284F7829e4A57) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/errors/src/custom_errors.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x0501CD5da5B453a18515B5A20b8029bd7583DFE7a399ad9f79c284F7829e4A57) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/errors/src/custom_errors.cairo).

source: ## Vault example
es: ## Ejemplo de Vault

source: Here's another example that demonstrates the use of errors in a more complex contract:
es: Aquí hay otro ejemplo que demuestra el uso de errores en un contrato más complejo:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x020C2da26F42A28Ef54ED428eF1810FE433784b055f9bF315C5d992b1579C268) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/errors/src/vault_errors.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x020C2da26F42A28Ef54ED428eF1810FE433784b055f9bF315C5d992b1579C268) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/errors/src/vault_errors.cairo).

source: # Events
es: # Eventos

source: Events are a way to emit data from a contract. All events must be defined in the `Event` enum, which must be annotated with the `#[event]` attribute. An event is defined as struct that derives the `#[starknet::Event]` trait. The fields of that struct correspond to the data that will be emitted. An event can be indexed for easy and fast access when querying the data at a later time. Events data can be indexed by adding a `#[key]` attribute to a field member.
es: Los eventos son una forma de emitir datos de un contrato. Todos los eventos deben definirse en la enumeración `Event`, que debe anotarse con el atributo `#[event]`. Un evento se define como una estructura que deriva el trait `#[starknet::Event]`. Los campos de esa estructura corresponden a los datos que se emitirán. Un evento se puede indexar para un acceso fácil y rápido al consultar los datos más adelante. Los datos de eventos se pueden indexar agregando un atributo `#[key]` a un miembro de campo.

source: Here's a simple example of a contract using events that emit an event each time a counter is incremented by the "increment" function:
es: A continuación se muestra un ejemplo simple de un contrato que utiliza eventos que emiten un evento cada vez que la función `increment` incrementa un contador:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x022e3B59518EA04aBb5da671ea04ecC3a154400f226d2Df38eFE146741b9E2F6) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/events/src/counter.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x022e3B59518EA04aBb5da671ea04ecC3a154400f226d2Df38eFE146741b9E2F6) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/ch00-getting-started/events/src/counter.cairo).

source: <footer id="last-change">Last change: 2023-12-21</footer>
es: <footer id="last-change">Último cambio: 2023-12-21</footer>

source: # Syscalls
es: # Llamadas al Sistema

source: At the protocol level, the Starknet Operating System (OS) is the program that manages the whole Starknet network.
es: A nivel de protocolo, el sistema operativo (SO) Starknet es el programa que gestiona toda la red Starknet.

source: Some of the OS functionalities are exposed to smart contracts through the use of syscalls (system calls). Syscalls can be used to get information about the state of the Starknet network, to interact with/deploy contracts, emit events, send messages, and perform other low-level operations.
es: Algunas de las funcionalidades del sistema operativo están expuestas a smart contracts mediante el uso de syscalls (llamadas al sistema). Las llamadas al sistema se pueden utilizar para obtener información sobre el estado de la red Starknet, para interactuar/implementar contratos, emitir eventos, enviar mensajes y realizar otras operaciones de bajo nivel.

source: Syscalls return a `SyscallResult` which is either `Sucess` of `Failure`, allowing the contract to handle errors.
es: Las llamadas al sistema devuelven un `SyscallResult` que es `Sucess` o `Failure`, lo que permite que el contrato maneje los errores.

source: Here's the available syscalls:
es: Aquí están las llamadas al sistema disponibles:

source: Get the hash of the block number `block_number`.
es: Obtenga el hash del número de bloque `block_number`.

source: Only within the range `[first_v0_12_0_block, current_block - 10]`.
es: Solo dentro del rango `[first_v0_12_0_block, current_block - 10]`.

source: Get information about the current execution context. The returned `ExecutionInfo` is defined as :
es: Obtenga información sobre el contexto de ejecución actual. La `ExecutionInfo` devuelta se define como:

source: `starknet::info` provides helper functions to access the `ExecutionInfo` fields in a more convenient way:
es: `starknet::info` proporciona funciones auxiliares para acceder a los campos `ExecutionInfo` de una manera más conveniente:

source: Call a contract at `address` with the given `entry_point_selector` and `calldata`. Failure can't be caught for this syscall, if the call fails, the whole transaction will revert.
es: Llame a un contrato en la`address` con el `entry_point_selector` y `calldata`proporcionados. No se puede detectar una falla en esta llamada al sistema; si la llamada falla, se revertirá toda la transacción.

source: This is not the recommended way to call a contract. Instead, use the dispatcher generated from the contract interface as shown in the [Calling other contracts](../interacting/calling_other_contracts.md).
es: Esta no es la forma recomendada de llamar a un contrato. En su lugar, utilice el despachador (dispatcher) generado desde la interfaz del contrato como se muestra en [Llamar a otros contratos] (../interacting/calling_other_contracts.md).

source: <!-- TODO Add example ? / with interact chapter -->
es: <!-- TODO ¿Agregar ejemplo? / con capítulo de interacción -->

source: Deploy a new contract of the predeclared class `class_hash` with `calldata`. The success result is a tuple containing the deployed contract address and the return value of the constructor.
es: Implemente un nuevo contrato de la clase predeclarada `class_hash` con `calldata`. El resultado exitoso es una tupla que contiene la dirección del contrato implementado y el valor de retorno del constructor.

source: `contract_address_salt` and `deploy_from_zero` are used to compute the contract address.
es: `contract_address_salt` y `deploy_from_zero` se utilizan para calcular la dirección del contrato.

source: Example of the usage of the `deploy` syscall from the [Factory pattern](../interacting/factory.md):
es: Ejemplo del uso de la llamada al sistema `deploy` del [Factory pattern] (../interacting/factory.md):

source: Emit an event with the given `keys` and `data`.
es: Emite un evento con las `keys` y los `data` proporcionados.

source: Example of the usage of the `emit_event` syscall from the [Events](../basics/events.md) chapter:
es: Ejemplo del uso de la llamada al sistema `emit_event` del capítulo [Eventos](../basics/events.md):

source: Call the function `function_selector` of the class `class_hash` with `calldata`. This is analogous to a delegate call in Ethereum, but only a single class is called.
es: Llame a la función `function_selector` de la clase `class_hash` con `calldata`. Esto es análogo a una llamada de delegado en Ethereum, pero solo se llama a una clase.

source: Send a message to the L1 contract at `to_address` with the given `payload`.
es: Envíe un mensaje al contrato L1 en `to_address` con la `payload` dada.

source: Replace the class of the calling contract with the class `class_hash`.
es: Reemplace la clase del contrato de llamada con la clase `class_hash`.

source: This is used for contract upgrades. Here's an example from the [Upgradeable Contract](../../ch01/upgradeable_contract.md):
es: Esto se utiliza para actualizaciones de contratos. Aquí hay un ejemplo del [Contrato actualizable](../../ch01/upgradeable_contract.md):

source: The new class code will only be used for future calls to the contract. The current transaction containing the `replace_class` syscall will continue to use the old class code. (You can explicitly use the new class code by calling `call_contract` after the `replace_class` syscall in the same transaction)
es: El nuevo código de clase sólo se utilizará para futuras llamadas al contrato. La transacción actual que contiene la llamada al sistema `replace_class` continuará usando el código de clase anterior. (Puede usar explícitamente el nuevo código de clase llamando a `call_contract` después de la llamada al sistema `replace_class` en la misma transacción)

source: This low-level syscall is used to get the value in the storage of a specific key at `address` in the `address_domain`.
es: Esta llamada al sistema de bajo nivel se utiliza para obtener el valor en el almacenamiento de una clave específica en la`address` en el `address_domain`.

source: `address_domain` is used to distinguish between data availability modes. Currently, only mode `ONCHAIN` (`0`) is supported.
es: `address_domain` se utiliza para distinguir entre modos de disponibilidad de datos. Actualmente, solo se admite el modo `ONCHAIN` (`0`).

source: Similar to `storage_read`, this low-level syscall is used to write the value `value` in the storage of a specific key at `address` in the `address_domain`.
es: Similar a `storage_read`, esta llamada al sistema de bajo nivel se usa para escribir el valor `value` en el almacenamiento de una clave específica en `address` en el `address_domain`.

source: ## Documentation
es: ## Documentación

source: Syscalls are defined in [`starknet::syscall`](https://github.com/starkware-libs/cairo/blob/ec14a5e2c484190ff40811c973a72a53739cedb7/corelib/src/starknet/syscalls.cairo)
es: Las llamadas al sistema se definen en [`starknet::syscall`](https://github.com/starkware-libs/cairo/blob/ec14a5e2c484190ff40811c973a72a53739cedb7/corelib/src/starknet/syscalls.cairo)

source: You can also read the [official documentation page](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/) for more details.
es: También puede leer la [página de documentación oficial](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/) para obtener más detalles.

source: # Storing Custom Types
es: # Almacenamiento de Tipos Personalizados

source: While native types can be stored in a contract's storage without any additional work, custom types require a bit more work. This is because at compile time, the compiler does not know how to store custom types in storage. To solve this, we need to implement the `Store` trait for our custom type. Hopefully, we can just derive this trait for our custom type - unless it contains arrays or dictionaries.
es: Si bien los tipos nativos se pueden almacenar en el almacenamiento de un contrato sin ningún trabajo adicional, los tipos personalizados requieren un poco más de trabajo. Esto se debe a que en el momento de la compilación, el compilador no sabe cómo almacenar tipos personalizados en el almacenamiento. Para resolver esto, necesitamos implementar el trait `Store`para nuestro tipo personalizado. Con suerte, podremos derivar este trait para nuestro tipo personalizado, a menos que contenga arrays o diccionarios.

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/storing_custom_types/src/contract.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/storing_custom_types/src/contract.cairo).

source: # Custom types in entrypoints
es: # Tipos personalizados en entrypoints

source: Using custom types in entrypoints requires our type to implement the `Serde` trait. This is because when calling an entrypoint, the input is sent as an array of `felt252` to the entrypoint, and we need to be able to deserialize it into our custom type. Similarly, when returning a custom type from an entrypoint, we need to be able to serialize it into an array of `felt252`. Thankfully, we can just derive the `Serde` trait for our custom type.
es: El uso de tipos personalizados en puntos de entrada requiere que nuestro tipo implemente el trait `Serde`. Esto se debe a que cuando se llama a un punto de entrada, la entrada se envía como una matriz de `felt252` al punto de entrada y necesitamos poder deserializarla en nuestro tipo personalizado. De manera similar, al devolver un tipo personalizado desde un punto de entrada, debemos poder serializarlo en una matriz de `felt252`. Afortunadamente, podemos derivar el trait `Serde` para nuestro tipo personalizado.

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/custom_type_serde/src/contract.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/getting-started/custom_type_serde/src/contract.cairo).

source: # Documentation
es: # Documentación

source: It's important to take the time to document your code. It will helps developers and users to understand the contract and its functionalities.
es: Es importante tomarse el tiempo para documentar su código. Ayudará a los desarrolladores y usuarios a comprender el contrato y sus funcionalidades.

source: In Cairo, you can add comments with `//`.
es: En Cairo, puedes agregar comentarios con `//`.

source: ### Best Practices:
es: ## Mejores Prácticas:

source: Since Cairo 1, the community has adopted a [Rust-like documentation style](https://doc.rust-lang.org/rust-by-example/meta/doc.html).
es: Desde Cairo 1, la comunidad ha adoptado un [estilo de documentación similar a [Rust-like documentation style](https://doc.rust-lang.org/rust-by-example/meta/doc.html).

source: ### Contract Interface:
es: ## Interfaz de Contrato:

source: In smart contracts, you will often have a trait that defines the contract's interface (with `#[starknet::interface]`). This is the perfect place to include detailed documentation explaining the purpose and functionality of the contract entry points. You can follow this template:
es: En los smart contracts, a menudo tendrá un trait que define la interfaz del contrato (con `#[starknet::interface]`). Este es el lugar perfecto para incluir documentación detallada que explique el propósito y la funcionalidad de los puntos de entrada del contrato. Puedes seguir esta plantilla:

source: Keep in mind that this should not describe the implementation details of the function, but rather the high-level purpose and functionality of the contract from the perspective of a user.
es: Tenga en cuenta que esto no debe describir los detalles de implementación de la función, sino más bien el propósito de alto nivel y la funcionalidad del contrato desde la perspectiva de un usuario.

source: ### Implementation Details:
es: ### Detalles de Implementación:

source: When writing the logic of the contract, you can add comments to describe the technical implementation details of the functions.
es: Al escribir la lógica del contrato, puede agregar comentarios para describir los detalles técnicos de implementación de las funciones.

source: > Avoid over-commenting: Comments should provide additional value and clarity.
es: > Evite comentarios excesivos: Los comentarios deben aportar valor y claridad adicionales.

source: <footer id="last-change">Last change: 2023-12-05</footer>
es: <footer id="last-change">Último cambio: 2023-12-05</footer>

source: # Deploy and interact with contracts
es: # Desplegar contratos e interactuar con ellos

source: In this chapter, we will see how to deploy and interact with contracts.
es: En este capítulo, veremos cómo implementar e interactuar con contratos.

source: <footer id="last-change">Last change: 2023-10-19</footer>
es: <footer id="last-change">Último cambio: 2023-10-19</footer>

source: # Contract interfaces and Traits generation
es: # Interfaces de Contratos y generación de Traits

source: Contract interfaces define the structure and behavior of a contract, serving as the contract's public ABI. They list all the function signatures that a contract exposes. For a detailed explanation of interfaces, you can refer to the [Cairo Book](https://book.cairo-lang.org/ch99-01-02-a-simple-contract.html).
es: Las interfaces de contrato definen la estructura y el comportamiento de un contrato y sirven como la ABI pública del contrato. Enumeran todas las firmas de funciones que expone un contrato. Para obtener una explicación detallada de las interfaces, puede consultar el [Cairo Book](https://book.cairo-lang.org/ch99-01-02-a-simple-contract.html).

source: In cairo, to specify the interface you need to define a trait annotated with `#[starknet::interface]` and then implement that trait in the contract.
es: En Cairo, para especificar la interfaz es necesario definir un trait anotado con `#[starknet::interface]` y luego implementar ese trait en el contrato.

source: When a function needs to access the contract state, it must have a `self` parameter of type `ContractState`. This implies that the corresponding function signature in the interface trait must also take a `TContractState` type as a parameter. It's important to note that every function in the contract interface must have this `self` parameter of type `TContractState`.
es: Cuando una función necesita acceder al estado del contrato, debe tener un parámetro `self` de tipo `ContractState`. Esto implica que la firma de función correspondiente en el trait de interfaz también debe tomar un tipo `TContractState` como parámetro. Es importante tener en cuenta que todas las funciones de la interfaz del contrato deben tener este parámetro `self` de tipo `TContractState`.
