Repository: NethermindEth/StarknetByExample
Catalog: po/*.po
Languages: es

source: > Note: While storing arrays in storage is possible, it is not always recommended, as the read and write operations can get very costly. For example, reading an array of size `n` requires `n` storage reads, and writing to an array of size `n` requires `n` storage writes. If you only need to access a single element of the array at a time, it is recommended to use a `LegacyMap` and store the length in another variable instead.
es: > Nota: Aunque es posible almacenar arrays, no siempre es recomendable, ya que las operaciones de lectura y escritura pueden ser muy costosas. Por ejemplo, leer un array de tamaño `n` requiere `n` lecturas de almacenamiento, y escribir en un array de tamaño `n` requiere `n` escrituras de almacenamiento. Si sólo necesitas acceder a un único elemento del array cada vez, se recomienda utilizar un `LegacyMap` y almacenar la longitud en otra variable.

source: The following example demonstrates how to write a simple implementation of the `StorageAccess` trait for the `Array<felt252>` type, allowing us to store arrays of up to 255 `felt252` elements.
es: El siguiente ejemplo muestra cómo escribir una implementación sencilla del trait `StorageAccess` para el tipo `Array<felt252>`, permitiéndonos almacenar arrays de hasta 255 elementos `felt252`.

source: You can then import this implementation in your contract and use it to store arrays in storage:
es: A continuación, puede importar esta implementación en su contrato y utilizarla para almacenar arrays en el almacenamiento:

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x008F8069a3Fcd7691Db46Dc3b6F9D2C0436f9200E861330957Fd780A3595da86) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/storing_arrays/src/contract.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x008F8069a3Fcd7691Db46Dc3b6F9D2C0436f9200E861330957Fd780A3595da86) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/storing_arrays/src/contract.cairo).

source: # Structs as mapping keys
es: # Estructuras como mapping keys

source: In order to use structs as mapping keys, you can use `#[derive(Hash)]` on the struct definition. This will automatically generate a hash function for the struct that can be used to represent the struct as a key in a `LegacyMap`.
es: Para utilizar estructuras como mapping keys, puede utilizar `#[derive(Hash)]` en la definición de la estructura. Esto generará automáticamente una función hash para la estructura que se puede utilizar para representar la estructura como una key en un `LegacyMap`.

source: Consider the following example in which we would like to use an object of type `Pet` as a key in a `LegacyMap`. The `Pet` struct has three fields: `name`, `age` and `owner`. We consider that the combination of these three fields uniquely identifies a pet.
es: Consideremos el siguiente ejemplo en el que queremos utilizar un objeto de tipo `Pet` como clave en un `LegacyMap`. La estructura `Pet` tiene tres campos: `nombre`, `edad` y `propietario`. Consideramos que la combinación de estos tres campos identifica de forma única a una mascota.

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/struct_as_mapping_key/src/contract.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/struct_as_mapping_key/src/contract.cairo).

source: Hashing is a cryptographic technique that allows you to transform a variable length input into a fixed length output. The resulting output is called a hash and it's completely different from the input. Hash functions are deterministic, meaning that the same input will always produce the same output.
es: El hash es una técnica criptográfica que permite transformar una entrada de longitud variable en una salida de longitud fija. La salida resultante se llama hash y es completamente diferente de la entrada. Las funciones hash son deterministas, lo que significa que la misma entrada siempre producirá la misma salida.

source: The two hash functions provided by the Cairo library are `Poseidon` and `Pedersen`. Pedersen hashes were used in the past (but still used in some scenario for backward compatibility) while Poseidon hashes are the standard nowadays since they were designed to be very efficient for Zero Knowledge proof systems.
es: Las dos funciones hash proporcionadas por la librería Cairo son `Poseidon` y `Pedersen`. Los hashes Pedersen se usaban en el pasado (pero todavía se usan en algunos escenarios por compatibilidad con versiones anteriores) mientras que los hashes Poseidon son el estándar hoy en día ya que fueron diseñados para ser muy eficientes para sistemas de Zero Knowledge proof.

source: In Cairo it's possible to hash all the types that can be converted to `felt252` since they implement natively the `Hash` trait. It's also possible to hash more complex types like structs by deriving the Hash trait with the attribute `#[derive(Hash)]` but only if all the struct's fields are themselves hashable.
es: En Cairo es posible hacer hash de todos los tipos que se pueden convertir a `felt252` ya que implementan nativamente el trait `Hash`. También es posible hacer hash de tipos más complejos como structs derivando el rasgo Hash con el atributo `#[derive(Hash)]` pero sólo si todos los campos del struct son a su vez hashables.

source: You first need to initialize a hash state with the `new` method of the `HashStateTrait` and then you can update it with the `update` method. You can accumulate multiple updates. Then, the `finalize` method returns the final hash value as a `felt252`.
es: Primero necesitas inicializar un estado hash con el método `new` del `HashStateTrait` y luego puedes actualizarlo con el método `update`. Puedes acumular múltiples actualizaciones. A continuación, el método `finalize` devuelve el valor hash final como un `felt252`.

source: # Hash Solidity Compatible
es: # Hash compatible con Solidity

source: This contract demonstrates Keccak hashing in Cairo to match Solidity's keccak256. While both use Keccak, their endianness differs: Cairo is little-endian, Solidity big-endian. The contract achieves compatibility by hashing in big-endian using `keccak_u256s_be_inputs`, and reversing the bytes of the result with `u128_byte_reverse`.
es: Este contrato demuestra el hashing Keccak en Cairo para que coincida con el keccak256 de Solidity. Mientras que ambos usan Keccak, su endianness difiere: Cairo es little-endian, Solidity big-endian. El contrato consigue la compatibilidad haciendo hashing en big-endian usando `keccak_u256s_be_inputs`, e invirtiendo los bytes del resultado con `u128_byte_reverse`.

source: Play with the contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/hash_solidity_compatible/src/contract.cairo).
es: Juega con el contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/hash_solidity_compatible/src/contract.cairo).

source: # Optimisations
es: # Optimizaciones

source: A collection of optimisation patterns to save gas and steps.
es: Una colección de patrones de optimización para ahorrar gas y pasos.

source: # Storage optimisation
es: # Optimización del Storage

source: A smart contract has a limited amount of **storage slots**. Each slot can store a single `felt252` value. Writing to a storage slot has a cost, so we want to use as few storage slots as possible.
es: Un contrato inteligente tiene una cantidad limitada de **ranuras de almacenamiento**. Cada ranura puede almacenar un único valor `felt252`. Escribir en una ranura de almacenamiento tiene un coste, por lo que queremos utilizar el menor número posible de ranuras de almacenamiento.

source: In Cairo, every type is derived from the `felt252` type, which uses 252 bits to store a value. This design is quite simple, but it does have a drawback: it is not storage efficient. For example, if we want to store a `u8` value, we need to use an entire slot, even though we only need 8 bits.
es: En Cairo, cada tipo deriva del tipo `felt252`, que utiliza 252 bits para almacenar un valor. Este diseño es bastante simple, pero tiene un inconveniente: no es eficiente en almacenamiento. Por ejemplo, si queremos almacenar un valor `u8`, necesitamos usar un slot entero, aunque sólo necesitemos 8 bits.

source: When storing multiple values, we can use a technique called **packing**. Packing is a technique that allows us to store multiple values in a single felt value. This is done by using the bits of the felt value to store multiple values.
es: Cuando almacenamos múltiples valores, podemos utilizar una técnica llamada **packing**. El empaquetado es una técnica que nos permite almacenar múltiples valores en un único valor de felt. Esto se hace utilizando los bits del valor de felt para almacenar múltiples valores.

source: For example, if we want to store two `u8` values, we can use the first 8 bits of the felt value to store the first `u8` value, and the last 8 bits to store the second `u8` value. This way, we can store two `u8` values in a single felt value.
es: Por ejemplo, si queremos almacenar dos valores `u8`, podemos utilizar los primeros 8 bits del valor de felt para almacenar el primer valor `u8`, y los últimos 8 bits para almacenar el segundo valor `u8`. De esta forma, podemos almacenar dos valores `u8` en un único valor de felt.

source: Cairo provides a built-in store using packing that you can use with the `StorePacking` trait.
es: Cairo proporciona un almacén incorporado que usa empaquetado que puedes usar con el trait `StorePacking`.

source: This allows to store the type `T` by first packing it into the type `PackedT` with the `pack` function, and then storing the `PackedT` value with it's `Store` implementation. When reading the value, we first retrieve the `PackedT` value, and then unpack it into the type `T` using the `unpack` function.
es: Esto permite almacenar el tipo `T` empaquetándolo primero en el tipo `PackedT` con la función `pack`, y luego almacenando el valor `PackedT` con su implementación `Store`. Al leer el valor, primero recuperamos el valor `PackedT`, y luego lo desempaquetamos en el tipo `T` utilizando la función `unpack`.

source: Here's an example of storing a `Time` struct with two `u8` values using the `StorePacking` trait:
es: He aquí un ejemplo de almacenamiento de una estructura `Time` con dos valores `u8` utilizando el trait `StorePacking`:

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet-cairo1-compiler&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/store_using_packing/src/contract.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet-cairo1-compiler&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/store_using_packing/src/contract.cairo).

source: # List
es: # Lista

source: By default, there is no list type supported in Cairo, but you can use Alexandria. You can refer to the [Alexandria documentation](https://github.com/keep-starknet-strange/alexandria/tree/main/src/storage) for more details.
es: Por defecto, no hay ningún tipo de lista soportado en Cairo, pero puedes usar Alexandria. Puede consultar la [documentación de Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/storage) para más detalles.

source: ## What is `List`?
es: ## ¿Qué es `List`?

source: An ordered sequence of values that can be used in Starknet storage:
es: Una secuencia ordenada de valores que puede utilizarse en el storage de Starknet:

source: `List` also implements `IndexView` so you can use the familiar bracket notation to access its members:
es: `List` también implementa `IndexView` para que puedas utilizar la notación familiar de corchetes para acceder a sus miembros:

source: Note that unlike `get`, using this bracket notation panics when accessing an out of bounds index.
es: Tenga en cuenta que, a diferencia de `get`, el uso de esta notación de corchetes entra en pánico cuando se accede a un índice fuera de los límites.

source: ### Support for custom types
es: ### Compatibilidad con tipos personalizados

source: `List` supports most of the corelib types out of the box. If you want to store a your own custom type in a `List`, it has to implement the `Store` trait. You can have the compiler derive it for you using the `#[derive(starknet::Store)]` attribute.
es: `List` soporta la mayoría de los tipos de corelib. Si quieres almacenar un tipo personalizado en una `List`, tiene que implementar el trait `Store`. Puedes hacer que el compilador lo derive por ti usando el atributo `#[derive(starknet::Store)]`.

source: ### Caveats
es: ### Advertencias

source: There are two idiosyncacies you should be aware of when using `List`
es: Hay dos particularidades que debe tener en cuenta al utilizar `List`

source: 1. The `append` operation costs 2 storage writes - one for the value itself and another one for updating the List's length 2. Due to a compiler limitation, it is not possible to use mutating operations with a single inline statement. For example, `self.amounts.read().append(42);` will not work. You have to do it in 2 steps:
es: 1. La operación `append` cuesta 2 escrituras de almacenamiento - una para el valor en sí y otra para actualizar la longitud de la Lista 2. Debido a una limitación del compilador, no es posible utilizar operaciones de mutación con una única sentencia inline. Por ejemplo, `self.amounts.read().append(42);` no funcionará. Tienes que hacerlo en 2 pasos:

source: ### Dependencies
es: ### Dependencias

source: Update your project dependencies by in the `Scarb.toml` file:
es: Actualice las dependencias de su proyecto en el archivo `Scarb.toml`:

source: For example, let's use `List` to create a contract that tracks a list of amounts and tasks:
es: Por ejemplo, utilicemos `List` para crear un contrato que realice el seguimiento de una lista de importes y tareas:
