Repository: NethermindEth/StarknetByExample
Catalog: po/*.po
Languages: es

source: > It's currently not possible to use the same component multiple times in the same contract. > This is a known limitation that may be lifted in the future. > > For now, you can view components as an implementation of a specific interface/feature (`Ownable`, `Upgradeable`, ... `~able`). > This is why we called it `Switchable` and not `Switch`; The contract *is switchable*, not *has a switch*.
es: > Actualmente no es posible utilizar el mismo componente varias veces en el mismo contrato. > Esta es una limitación conocida que puede eliminarse en el futuro. > > Por ahora, puede ver los componentes como una implementación de una interfaz/función específica (`Ownable`, `Upgradeable`, ... `~able`). > Por eso lo llamamos `Switchable` y no `Switch`; El contrato *es switchable*, no *tiene un switch*.

source: ## How to use a component
es: ## Cómo utilizar un componente

source: Now that we have a component, we can use it in a contract. The following contract incorporates the `Switchable` component:
es: Ahora que tenemos un componente, podemos usarlo en un contrato. El siguiente contrato incorpora el componente `Switchable`:

source: ## Deep dive into components
es: ## Profundización en los componentes

source: You can find more in-depth information about components in the [Cairo book - Components](https://book.cairo-lang.org/ch99-01-05-00-components.html).
es: Puede encontrar información más detallada sobre los componentes en el [Cairo book - Components](https://book.cairo-lang.org/ch99-01-05-00-components.html).

source: # Components Dependencies
es: # Dependencias de Componentes

source: A component with a dependency on a trait T can be used in a contract as long as the contract implements the trait T.
es: Un componente que depende de un trait T se puede utilizar en un contrato siempre que el contrato implemente el trait T.

source: We will use a new `Countable` component as an example:
es: Usaremos un nuevo componente `Countable` como ejemplo:

source: We want to add a way to enable or disable the counter, in a way that calling `increment` on a disabled counter will not increment the counter. But we don't want to add this switch logic to the `Countable` component itself. We instead add the trait `Switchable` as a dependency to the `Countable` component.
es: Queremos agregar una forma de habilitar o deshabilitar el contador, de manera que llamar a `increment` en un contador deshabilitado no incremente el contador. Pero no queremos agregar esta lógica de cambio al componente`Countable`. En su lugar, agregamos el trait `Switchable` como una dependencia del componente `Countable`.

source: #### Implementation of the trait in the contract
es: #### Implementación del trait en el contrato

source: We first define the `ISwitchable` trait:
es: Primero definimos el trait `ISwitchable`:

source: Then we can modify the implementation of the `Countable` component to depend on the `ISwitchable` trait:
es: Luego podemos modificar la implementación del componente `Countable` para que dependa del rasgo `ISwitchable`:

source: A contract that uses the `Countable` component must implement the `ISwitchable` trait:
es: Un contrato que utilice el componente `Countable` debe implementar el trait `ISwitchable`:

source: #### Implementation of the trait in another component
es: #### Implementación del trait en otro componente

source: In the previous example, we implemented the `ISwitchable` trait in the contract.
es: En el ejemplo anterior, implementamos el rasgo `ISwitchable` en el contrato.

source: We already implemented a [`Switchable`](./how_to.md) component that provide an implementation of the `ISwitchable` trait. By using the `Switchable` component in a contract, we embed the implementation of the `ISwitchable` trait in the contract and resolve the dependency on the `ISwitchable` trait.
es: Ya hemos implementado un componente [`Switchable`](./how_to.md) que proporciona una implementación del trait `ISwitchable`. Al utilizar el componente `Switchable` en un contrato, incrustamos la implementación del trait `ISwitchable` en el contrato y resolvemos la dependencia del trait `ISwitchable`.

source: #### Dependency on other components internal functions
es: #### Dependencia de funciones internas de otros componentes

source: The previous example shows how to use the `ISwitchable` trait implementation from the `Switchable` component inside the `Countable` component by embedding the implementation in the contract. However, suppose we would like to turn off the switch after each increment. There's no `set` function in the `ISwitchable` trait, so we can't do it directly.
es: El ejemplo anterior muestra cómo utilizar la implementación del rasgo `ISwitchable` del componente `Switchable` dentro del componente `Countable` incrustando la implementación en el contrato. Sin embargo, supongamos que queremos apagar el interruptor después de cada incremento. No hay función `set` en el trait `ISwitchable`, así que no podemos hacerlo directamente.

source: But the Switchable component implements the internal function `_off` from the `SwitchableInternalTrait` that set the switch to `false`. We can't embed `SwitchableInternalImpl`, but we can add `switchable::HasComponent<TContractState>` as a dependency inside `CountableImpl`.
es: Pero el componente Switchable implementa la función interna `_off` del `SwitchableInternalTrait` que establece el interruptor a `false`. No podemos incrustar `SwitchableInternalImpl`, pero podemos añadir `switchable::HasComponent<TContractState>` como dependencia dentro de `CountableImpl`.

source: We make the `Countable` component depend on the `Switchable` component. This will allow to do `switchable::ComponentState<TContractState>` -> `TContractState` -> `countable::ComponentState<TcontractState>` and access the internal functions of the `Switchable` component inside the `Countable` component:
es: Hacemos que el componente `Countable` dependa del componente `Switchable`. Esto permitirá hacer `switchable::ComponentState<TContractState>` -> `TContractState` -> `countable::ComponentState<TcontractState>` y acceder a las funciones internas del componente `Switchable` dentro del componente `Countable`:

source: The contract remains the same that the previous example, but the implementation of the `Countable` component is different:
es: El contrato sigue siendo el mismo que en el ejemplo anterior, pero la implementación del componente `Countable` es diferente:

source: # Component-Contract Storage Collisions
es: # Colisiones Componente-Contrato de Almacenamiento

source: Components can declare their own storage variables.
es: Los componentes pueden declarar sus propias variables de almacenamiento.

source: When a contract use a component, the component storage is merged with the contract storage. The storage layout is only determined by the variables names, so variables with the same name will collide.
es: Cuando un contrato utiliza un componente, el almacenamiento del componente se fusiona con el almacenamiento del contrato. La disposición del almacenamiento sólo está determinada por los nombres de las variables, por lo que las variables con el mismo nombre colisionarán.

source: > In a future release, the `#[substorage(v1)]` will determine the storage layout based on the component as well, so collisions will be avoided.
es: > En una futura versión, el `#[substorage(v1)]` determinará la disposición del almacenamiento basándose también en el componente, por lo que se evitarán colisiones.

source: A good practice is to prefix the component storage variables with the component name, as shown in the [Switchable component example](./how_to.md).
es: Una buena práctica es anteponer a las variables de almacenamiento del componente el nombre del componente, como se muestra en el [Ejemplo de componente conmutable](./how_to.md).

source: #### Example
es: #### Ejemplo

source: Here's an example of a collision on the `switchable_value` storage variable of the `Switchable` component.
es: He aquí un ejemplo de colisión en la variable de almacenamiento `switchable_value` del componente `Switchable`.

source: Here's the storage of the contract (you can expand the code snippet to see the full contract):
es: Aquí tienes el almacenamiento del contrato (puedes ampliar el fragmento de código para ver el contrato completo):

source: Both the contract and the component have a `switchable_value` storage variable, so they collide:
es: Tanto el contrato como el componente tienen una variable de almacenamiento `switchable_value`, por lo que colisionan:

source: The following `Ownable` component is a simple component that allows the contract to set an owner and provides a `_assert_is_owner` function that can be used to ensure that the caller is the owner.
es: El siguiente componente `Ownable` es un componente simple que permite al contrato establecer un propietario y proporciona una función `_assert_is_owner` que se puede utilizar para asegurarse de que el llamante es el propietario.

source: It can also be used to renounce ownership of a contract, meaning that no one will be able to satisfy the `_assert_is_owner` function.
es: También se puede utilizar para renunciar a la propiedad de un contrato, lo que significa que nadie podrá satisfacer la función `_assert_is_owner`.

source: A mock contract that uses the `Ownable` component:
es: Un contrato simulado que utiliza el componente `Ownable`:

source: <footer id="last-change">Last change: 2024-01-05</footer>
es: <footer id="last-change">Última modificación: 2024-01-05</footer>

source: # Upgradeable Contract
es: # Contratos Actualizables

source: In Starknet, contracts are divided into two parts: contract classes and contract instances. This division follows a similar concept used in object-oriented programming languages, where we distinguish between the definition and implementation of objects.
es: En Starknet, los contratos se dividen en dos partes: clases de contratos e instancias de contratos. Esta división sigue un concepto similar al utilizado en los lenguajes de programación orientados a objetos, en los que se distingue entre definición e implementación de objetos.

source: A contract class is the definition of a contract: it specifies how the contract behaves. It contains essential information like the Cairo byte code, hint information, entry point names, and everything that defines its semantics unambiguously.
es: Una clase de contrato es la definición de un contrato: especifica cómo se comporta el contrato. Contiene información esencial como el código de bytes de Cairo, información de pistas, nombres de puntos de entrada y todo lo que define su semántica sin ambigüedades.

source: To identify different contract classes, Starknet assigns a unique identifier to each class: the class hash. A contract instance is a deployed contract that corresponds to a specific contract class. Think of it as an instance of an object in languages like Java.
es: Para identificar las diferentes clases de contratos, Starknet asigna un identificador único a cada clase: el hash de la clase. Una instancia de contrato es un contrato desplegado que corresponde a una clase de contrato específica. Piense en ello como una instancia de un objeto en lenguajes como Java.

source: Each class is identified by its class hash, which is analogous to a class name in an object-oriented programming language. A contract instance is a deployed contract corresponding to a class.
es: Cada clase se identifica por su hash de clase, que es análogo a un nombre de clase en un lenguaje de programación orientado a objetos. Una instancia de contrato es un contrato desplegado correspondiente a una clase.

source: You can upgrade a deployed contract to a newer version by calling the `replace_class_syscall` function. By using this function, you can update the class hash associated with a deployed contract, effectively upgrading its implementation. However, this will not modify the contract's storage, so all the data stored in the contract will remain the same.
es: Puedes actualizar un contrato desplegado a una versión más reciente llamando a la función `replace_class_syscall`. Usando esta función, puedes actualizar el hash de clase asociado con un contrato desplegado, actualizando efectivamente su implementación. Sin embargo, esto no modificará el almacenamiento del contrato, por lo que todos los datos almacenados en el contrato seguirán siendo los mismos.

source: To illustrate this concept, let's consider an example with two contracts: `UpgradeableContract_V0`, and `UpgradeableContract_V1`. Start by deploying `UpgradeableContract_V0` as the initial version. Next, send a transaction that invokes the `upgrade` function, with the class hash of `UpgradeableContract_V1` as parameter to upgrade the class hash of the deployed contract to the `UpgradeableContract_V1` one. Then, call the `version` method on the contract to see that the contract was upgraded to the V1 version.
es: Para ilustrar este concepto, consideremos un ejemplo con dos contratos: Contrato Actualizable V0 y Contrato Actualizable V1. Comience desplegando `UpgradeableContract_V0` como versión inicial. A continuación, envía una transacción que invoque a la función `upgrade`, con el hash de clase del `UpgradeableContract_V1` como parámetro para actualizar el hash de clase del contrato desplegado al del `UpgradeableContract_V1`. Luego, llama al método `version` en el contrato para ver que el contrato fue actualizado a la versión V1.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x005300003ade5d10447d941a42d48b7141074cd8bade2b16520684896a5090ea) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/upgradeable_contract/src/upgradeable_contract_v0.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x005300003ade5d10447d941a42d48b7141074cd8bade2b16520684896a5090ea) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/upgradeable_contract/src/upgradeable_contract_v0.cairo).

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x017c86152badd1d665b9836571bd6b0a484f028748aa13d9b2d5d9c9192fafc6) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/upgradeable_contract/src/upgradeable_contract_v1.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x017c86152badd1d665b9836571bd6b0a484f028748aa13d9b2d5d9c9192fafc6) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/upgradeable_contract/src/upgradeable_contract_v1.cairo).

source: This is the Cairo adaptation of the [Solidity by example Vault](https://solidity-by-example.org/defi/vault/). Here's how it works:
es: Se trata de la adaptación cairota de la [Solidity by example Vault](https://solidity-by-example.org/defi/vault/). Funciona de la siguiente manera:

source: - When a user deposits a token, the contract calculates the amount of shares to mint. - When a user withdraws, the contract burns their shares, calculates the yield, and withdraw both the yield and the initial amount of token deposited.
es: - Cuando un usuario deposita un token, el contrato calcula la cantidad de acciones a acuñar. - Cuando un usuario retira, el contrato quema sus acciones, calcula el rendimiento y retira tanto el rendimiento como la cantidad inicial de token depositada.

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/simple_vault/src/simple_vault.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/simple_vault/src/simple_vault.cairo).

source: # ERC20 Token
es: # Token ERC20

source: Contracts that follow the [ERC20 Standard](https://eips.ethereum.org/EIPS/eip-20) are called ERC20 tokens. They are used to represent fungible assets.
es: Los contratos que siguen el [Standard ERC20](https://eips.ethereum.org/EIPS/eip-20) se denominan tokens ERC20. Se utilizan para representar activos fungibles.

source: To create an ERC20 conctract, it must implement the following interface:
es: Para crear un contrato ERC20, debe implementar la siguiente interfaz:

source: In Starknet, function names should be written in *snake_case*. This is not the case in Solidity, where function names are written in *camelCase*. The Starknet ERC20 interface is therefore slightly different from the Solidity ERC20 interface.
es: En Starknet, los nombres de las funciones deben escribirse en *snake_case*. Este no es el caso en Solidity, donde los nombres de las funciones se escriben en *camelCase*. Por lo tanto, la interfaz ERC20 de Starknet es ligeramente diferente de la interfaz ERC20 de Solidity.

source: Here's an implementation of the ERC20 interface in Cairo:
es: He aquí una implementación de la interfaz ERC20 en Cairo:

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/erc20/src/token.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/erc20/src/token.cairo).

source: There's several other implementations, such as the [Open Zeppelin](https://docs.openzeppelin.com/contracts-cairo/0.7.0/erc20) or the [Cairo By Example](https://cairo-by-example.com/examples/erc20/) ones.
es: Existen otras implementaciones, como la [Open Zeppelin](https://docs.openzeppelin.com/contracts-cairo/0.7.0/erc20) o la [Cairo By Example](https://cairo-by-example.com/examples/erc20/).

source: # Constant Product AMM
es: # AMM de Producto Constante

source: This is the Cairo adaptation of the [Solidity by example Constant Product AMM](https://solidity-by-example.org/defi/constant-product-amm/).
es: Se trata de la adaptación cairota de la [Solidez por ejemplo Producto Constante AMM](https://solidity-by-example.org/defi/constant-product-amm/).

source: Play with this contract in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/constant_product_amm/src/constant_product_amm.cairo).
es: Juega con este contrato en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/applications/constant_product_amm/src/constant_product_amm.cairo).

source: # Writing to any storage slot
es: # Escribir en cualquier ranura de almacenamiento

source: On Starknet, a contract's storage is a map with 2^251 slots, where each slot is a felt which is initialized to 0. The address of storage variables is computed at compile time using the formula: `storage variable address := pedersen(keccak(variable name), keys)`. Interactions with storage variables are commonly performed using the `self.var.read()` and `self.var.write()` functions.
es: En Starknet, el almacenamiento de un contrato es un mapa con 2^251 ranuras, donde cada ranura es un fieltro que se inicializa a 0. La dirección de las variables de almacenamiento se calcula en tiempo de compilación mediante la fórmula `dirección de variable de almacenamiento := pedersen(keccak(nombre de variable), keys)`. Las interacciones con las variables de almacenamiento se realizan normalmente utilizando las funciones `self.var.read()` y `self.var.write()`.

source: Nevertheless, we can use the `storage_write_syscall` and `storage_read_syscall` syscalls, to write to and read from any storage slot. This is useful when writing to storage variables that are not known at compile time, or to ensure that even if the contract is upgraded and the computation method of storage variable addresses changes, they remain accessible.
es: Sin embargo, podemos usar las llamadas al sistema `storage_write_syscall` y `storage_read_syscall`, para escribir y leer desde cualquier ranura de almacenamiento. Esto es útil cuando se escribe en variables de almacenamiento que no se conocen en tiempo de compilación, o para asegurarse de que incluso si el contrato se actualiza y el método de cálculo de las direcciones de las variables de almacenamiento cambia, siguen siendo accesibles.

source: In the following example, we use the Poseidon hash function to compute the address of a storage variable. Poseidon is a ZK-friendly hash function that is cheaper and faster than Pedersen, making it an excellent choice for onchain computations. Once the address is computed, we use the storage syscalls to interact with it.
es: En el siguiente ejemplo, utilizamos la función hash Poseidon para calcular la dirección de una variable de almacenamiento. Poseidon es una función hash compatible con ZK que es más barata y rápida que Pedersen, lo que la convierte en una excelente elección para cálculos en cadena. Una vez calculada la dirección, utilizamos las llamadas al sistema de almacenamiento para interactuar con ella.

source: Visit contract on [Voyager](https://goerli.voyager.online/contract/0x033943CB781A4E63C9dcE0A1A09eAa3b617AA43CC61637C08c043a67f3fe0087) or play with it in [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/write_to_any_slot/src/contract.cairo).
es: Visita el contrato en [Voyager](https://goerli.voyager.online/contract/0x033943CB781A4E63C9dcE0A1A09eAa3b617AA43CC61637C08c043a67f3fe0087) o juega con él en [Remix](https://remix.ethereum.org/?#activate=Starknet&url=https://github.com/NethermindEth/StarknetByExample/blob/main/listings/advanced-concepts/write_to_any_slot/src/contract.cairo).

source: # Storing Arrays
es: # Almacenamiento de Arrays

source: On Starknet, complex values (e.g., tuples or structs), are stored in a continuous segment starting from the address of the storage variable. There is a 256 field elements limitation to the maximal size of a complex storage value, meaning that to store arrays of more than 255 elements in storage, we would need to split it into segments of size `n <= 255` and store these segments in multiple storage addresses. There is currently no native support for storing arrays in Cairo, so you will need to write your own implementation of the `Store` trait for the type of array you wish to store.
es: En Starknet, los valores complejos (por ejemplo, tuplas o structs), se almacenan en un segmento continuo a partir de la dirección de la variable de almacenamiento. Hay una limitación de 256 elementos de campo para el tamaño máximo de un valor de almacenamiento complejo, lo que significa que para almacenar matrices de más de 255 elementos en el almacenamiento, necesitaríamos dividirlo en segmentos de tamaño `n <= 255` y almacenar estos segmentos en múltiples direcciones de almacenamiento. Actualmente no hay soporte nativo para almacenar arrays en Cairo, por lo que necesitarás escribir tu propia implementación del rasgo `Store` para el tipo de array que desees almacenar.
